Repository: fanshuyi/.netcore-admin
Catalog: Web/LocalizationResources/ExpressLocalizationResource.*.resx
Languages: ru, sv, vi

source: A non-empty request body is required.
ru: Требуется непустое тело запроса.
sv: En icke-tom begäran krävs.
vi: Một cơ thể yêu cầu không có sản phẩm nào được yêu cầu.

source: A user with this login already exists.
ru: Пользователь с таким логином уже существует.
sv: En användare med denna inloggning finns redan.
vi: Người dùng có đăng nhập này đã tồn tại.

source: A value for the '{0}' parameter or property was not provided.
ru: не было представлено значение для «{0}» параметра или свойства.
sv: Ett värde för '{0}' parameter eller egendom angavs inte.
vi: Một giá trị cho '{0}' tham số hoặc tài sản không được cung cấp.

source: A value is required.
ru: Требуется значение.
sv: Ett värde krävs.
vi: Một giá trị là bắt buộc.

source: An unknown failure has occurred.
ru: Неизвестная авария произошла.
sv: Ett okänt fel har inträffat.
vi: Một thất bại không rõ đã xảy ra.

source: Both ErrorMessageResourceType and ErrorMessageResourceName need to be set on this attribute.
ru: Оба ErrorMessageResourceType и ErrorMessageResourceName должны быть установлены в этом атрибуте.
sv: Både ErrorMessageResourceType och ErrorMessageResourceName måste ställas på detta attribut.
vi: Cả hai ErrorMessageResourceType và ErrorMessageResourceName cần phải được đặt trên thuộc tính này.

source: Cannot retrieve property '{0}' because localization failed. Type '{1}' is not public or does not contain a public static string property with the name '{2}'.
ru: Невозможно получить свойство «{0}», потому что локализация не удалось. Тип «{1}» не является общедоступной или не содержит публичный статический строковое свойство с именем «{2}».
sv: Det går inte att hämta egendom '{0}' eftersom lokalisering misslyckades. Skriv '{1}' är inte offentliga eller inte innehålla en public static sträng egendom med namnet '{2}'.
vi: Không thể truy bất động sản '{0}' vì nội địa hóa thất bại. Loại '{1}' không được công khai hoặc không chứa một tài sản chuỗi public static với tên '{2}'.

source: Confirm password
ru: Подтвердите Пароль
sv: Bekräfta lösenord
vi: Xác nhận mật khẩu

source: Could not convert the value of type '{0}' to '{1}' as expected by method {2}.{3}.
ru: Не удалось преобразовать значение типа '{0}' в '{1}', как ожидалось по методу {2}. {3}.
sv: Kunde inte konvertera värdet av typen '{0}' till '{1}' som förväntas av metoden {2}. {3}.
vi: Không thể chuyển đổi các giá trị của loại '{0}' thành '{1}' như mong đợi bằng phương pháp {2}. {3}.

source: Could not find a property named {0}.
ru: Не удалось найти свойство с именем {0}.
sv: Kunde inte hitta en egenskap med namnet {0}.
vi: không thể tìm thấy một tài sản có tên {0}.

source: Date
ru: Дата
sv: Datum
vi: Ngày

source: Either ErrorMessageString or ErrorMessageResourceName must be set, but not both.
ru: Либо ErrorMessageString или ErrorMessageResourceName должен быть установлен, но не оба.
sv: Antingen ErrorMessageString eller ErrorMessageResourceName måste ställas in, men inte båda.
vi: Hoặc ErrorMessageString hoặc ErrorMessageResourceName phải được thiết lập, nhưng không phải cả hai.

source: Email
ru: Эл. адрес
sv: E-post

source: Email '{0}' is already taken.
ru: Отправить «{0}» уже принято.
sv: E '{0}' är upptaget.
vi: Email '{0}' đã được sử dụng.

source: Email '{0}' is invalid.
ru: Отправить '{0}' является недействительным.
sv: E '{0}' är ogiltig.
vi: Email '{0}' không hợp lệ.

source: ID
ru: Я БЫ

source: Incorrect password.
ru: Неверный пароль.
sv: Fel lösenord.
vi: Mật khẩu không đúng.

source: Invalid token.
ru: Недопустимый маркер.
sv: Ogiltig token.
vi: Mã không hợp lệ.

source: IsValid(object value) has not been implemented by this class. The preferred entry point is GetValidationResult() and classes should override IsValid(object value, ValidationContext context).
ru: IsValid (значение объекта) не был реализован этим классом. Предпочтительная точка входа GetValidationResult () и классы должны переопределить IsValid (значение объекта, ValidationContext контекст).
sv: IsValid (objektvärdet) inte har genomförts av denna klass. Den föredragna ingångspunkt är GetValidationResult () och klasser bör åsidosätta IsValid (objektvärdet, ValidationContext sammanhang).
vi: IsValid (giá trị đối tượng) chưa được thực hiện bởi lớp này. Điểm vào ưa thích là GetValidationResult () và các lớp học nên ghi đè IsValid (giá trị đối tượng, ValidationContext ngữ cảnh).

source: Lockout is not enabled for this user.
ru: Блокировка не включена для этого пользователя.
sv: Lockout är inte aktiverat för den här användaren.
vi: Lockout không được kích hoạt cho người dùng này.

source: MaxLengthAttribute must have a Length value that is greater than zero. Use MaxLength() without parameters to indicate that the string or array can have the maximum allowable length.
ru: MaxLengthAttribute должен иметь значение длины, которое больше нуля. Используйте MaxLength () без параметров, чтобы указать, что строка или массив может иметь максимально допустимую длину.
sv: MaxLengthAttribute måste ha en längd värde som är större än noll. Använd MaxLength () utan parametrar för att indikera att sträng eller array kan ha maximalt tillåten längd.
vi: MaxLengthAttribute phải có giá trị Chiều dài đó là lớn hơn không. Sử dụng maxlength () không có tham số để chỉ ra rằng chuỗi hoặc mảng có thể có độ dài tối đa cho phép.

source: MetadataClassType cannot be null.
ru: MetadataClassType не может быть пустым.
sv: MetadataClassType kan inte vara null.
vi: MetadataClassType không thể được null.

source: MinLengthAttribute must have a Length value that is zero or greater.
ru: MinLengthAttribute должен иметь значение длины, что равен нулю или больше.
sv: MinLengthAttribute måste ha en längd värde som är noll eller större.
vi: MinLengthAttribute phải có giá trị Chiều dài đó là zero hoặc cao hơn.

source: Name
ru: название
sv: namn
vi: Tên

source: Optimistic concurrency failure, object has been modified.
ru: Отказ Оптимистичный параллелизм, объект был изменен.
sv: Optimistisk samtidighet fel har föremål ändrats.
vi: thất bại đồng thời lạc quan, đối tượng đã được sửa đổi.

source: Password
ru: пароль
sv: Lösenord
vi: Mật khẩu

source: Passwords must be at least {0} characters.
ru: Пароли должны быть по крайней мере {0} символов.
sv: Lösenord måste vara minst {0} tecken.
vi: Mật khẩu phải có ít nhất {0} ký tự.

source: Passwords must have at least one digit ('0'-'9').
ru: Пароли должны иметь по крайней мере одну цифру ( «0» - «9»).
sv: Lösenord måste ha minst en siffra ( '0' - '9').
vi: Mật khẩu phải có ít nhất một chữ số ( '0' - '9').

source: Passwords must have at least one lowercase ('a'-'z').
ru: Пароли должны иметь по крайней мере, один нижний регистр ( «A» - «Z»).
sv: Lösenord måste ha minst en gemen ( 'a' - 'z').
vi: Mật khẩu phải có ít nhất một chữ thường ( 'a' - 'z').

source: Passwords must have at least one non alphanumeric character.
ru: Пароли должны иметь по крайней мере один не алфавитно-цифровой символ.
sv: Lösenord måste ha minst en icke alfanumeriskt tecken.
vi: Mật khẩu phải có ít nhất một nhân vật phi tự chữ và số.

source: Passwords must have at least one uppercase ('A'-'Z').
ru: Пароли должны иметь по меньшей мере один верхний регистр ( «A» - «Z»).
sv: Lösenord måste ha minst ett versalt ( 'A' - 'Z').
vi: Mật khẩu phải có ít nhất một chữ hoa ( 'A' - 'Z').

source: Passwords must use at least {0} different characters.
ru: Пароли должны использовать по крайней мере {0} различных символов.
sv: Lösenord måste använda minst {0} olika tecken.
vi: Mật khẩu phải sử dụng ít nhất {0} nhân vật khác nhau.

source: Price
ru: Цена
sv: Pris
vi: Giá bán

source: Recovery code redemption failed.
ru: Восстановление код выкуп не удался.
sv: Återställningskod inlösen misslyckades.
vi: Phục hồi đang cứu chuộc thất bại.

source: Role name '{0}' is already taken.
ru: Имя роли «{0}» уже принято.
sv: Roll namnet '{0}' är upptaget.
vi: tên vai trò '{0}' đã được sử dụng.

source: Role name '{0}' is invalid.
ru: Имя роли «{0}» является недействительным.
sv: Roll namnet '{0}' är ogiltig.
vi: tên vai trò '{0}' không hợp lệ.

source: The argument '{0}' cannot be null, empty or contain only whitespace.
ru: Аргумент «{0}» не может быть пустым, пустым или содержать только пробелы.
sv: Argumentet '{0}' inte kan vara null, tom eller innehålla endast blanksteg.
vi: Đối số '{0}' không thể được null, trống hoặc chỉ chứa khoảng trắng.

source: The associated metadata type for type '{0}' contains the following unknown properties or fields: {1}. Please make sure that the names of these members match the names of the properties on the main type.
ru: Соответствующий тип метаданных для типа «{0}» содержит следующие неизвестные свойства или полей: {1}. Пожалуйста, убедитесь, что имена этих членов совпадают с именами свойств на основном виде.
sv: Den associerade metadatatyp för typ '{0}' innehåller följande okända egenskaper eller fält: {1}. Se till att namnen på dessa medlemmar matcha namnen på de egenskaper på den vanligaste typen.
vi: Các liên loại siêu dữ liệu cho loại '{0}' chứa các thuộc tính hoặc các lĩnh vực chưa biết sau: {1}. Hãy đảm bảo rằng tên của các thành viên phù hợp với tên của các thuộc vào loại chính.

source: The custom DataType string cannot be null or empty.
ru: Строка пользовательских DataType не может быть нулевой или пустой.
sv: Den anpassade Datatyp strängen kan inte vara null eller tom.
vi: Chuỗi tùy chỉnh DataType không thể được null hoặc rỗng.

source: The custom validation type '{0}' must be public.
ru: Пользовательский тип проверки «{0}» должен быть публичным.
sv: Typen anpassade validerings {0} "måste vara offentliga.
vi: Kiểu xác nhận tùy chỉnh '{0}' phải được công khai.

source: The CustomValidationAttribute method '{0}' does not exist in type '{1}' or is not public and static.
ru: Метод CustomValidationAttribute «{0}» не существует в типа «{1}» или не является общедоступной и статическим.
sv: Den CustomValidationAttribute metoden '{0}' finns inte i typ '{1}' eller är inte offentlig och statisk.
vi: Phương pháp CustomValidationAttribute '{0}' không tồn tại trong loại '{1}' hoặc là không được công khai và tĩnh.

source: The CustomValidationAttribute method '{0}' in type '{1}' must match the expected signature: public static ValidationResult {0}(object value, ValidationContext context). The value can be strongly typed. The ValidationContext parameter is optional.
ru: Метод CustomValidationAttribute '{0}' по типу '{1}' должен соответствовать ожидаемому подпись: публичный статический ValidationResult {0} (значение объекта, ValidationContext контекст). Значение может быть сильно типизированных. Параметр ValidationContext является необязательным.
sv: Den CustomValidationAttribute metoden '{0}' i typen '{1}' måste matcha den förväntade signaturen: public static ValidationResult {0} (objektvärdet, ValidationContext sammanhang). Värdet kan starkt skrivit. Den ValidationContext parametern är valfri.
vi: Phương pháp CustomValidationAttribute '{0}' trong kiểu '{1}' phải khớp với chữ ký mong đợi: public static ValidationResult {0} (giá trị đối tượng, ValidationContext ngữ cảnh). Giá trị có thể được mạnh mẽ gõ. Tham số ValidationContext là không bắt buộc.

source: The CustomValidationAttribute method '{0}' in type '{1}' must return System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success to represent success.
ru: Метод CustomValidationAttribute '{0}' по типу '{1}' должен вернуть System.ComponentModel.DataAnnotations.ValidationResult. Используйте System.ComponentModel.DataAnnotations.ValidationResult.Success для представления успеха.
sv: Den CustomValidationAttribute metoden '{0}' i typen '{1}' måste returnera System.ComponentModel.DataAnnotations.ValidationResult. Använd System.ComponentModel.DataAnnotations.ValidationResult.Success att representera framgång.
vi: Phương pháp CustomValidationAttribute '{0}' trong kiểu '{1}' phải trả lại System.ComponentModel.DataAnnotations.ValidationResult. Sử dụng System.ComponentModel.DataAnnotations.ValidationResult.Success để đại diện cho sự thành công.

source: The CustomValidationAttribute.Method was not specified.
ru: CustomValidationAttribute.Method не был указан.
sv: Den CustomValidationAttribute.Method angavs inte.
vi: Các CustomValidationAttribute.Method không quy định rõ.

source: The CustomValidationAttribute.ValidatorType was not specified.
ru: CustomValidationAttribute.ValidatorType не был указан.
sv: Den CustomValidationAttribute.ValidatorType angavs inte.
vi: Các CustomValidationAttribute.ValidatorType không quy định rõ.

source: The field must be a number.
ru: Поле должно быть числом.
sv: Fältet måste vara ett nummer.
vi: Các lĩnh vực phải là một số.

source: The field of type {0} must be a string, array or ICollection type.
ru: Поле типа {0} должна быть строка, массив или тип ICollection.
sv: Området för typen {0} måste vara en sträng, array eller iCollection typ.
vi: Các lĩnh vực loại {0} phải là một chuỗi, mảng hoặc loại ICollection.

source: The field {0} is invalid.
ru: Поле {0} является недопустимым.
sv: Fältet {0} är ogiltig.
vi: Các lĩnh vực {0} không hợp lệ.

source: The field {0} must be a number.
ru: Поле {0} должно быть числом.
sv: Fältet {0} måste vara ett nummer.
vi: Các lĩnh vực {0} phải là một số.

source: The field {0} must be a string or array type with a maximum length of '{1}'.
ru: Поле {0} должно быть строка или массив типа с максимальной длиной «{1}».
sv: Fältet {0} måste vara en sträng eller array-typ med en maximal längd av '{1}'.
vi: Các lĩnh vực {0} phải là một chuỗi hoặc mảng loại với chiều dài tối đa của '{1}'.

source: The field {0} must be a string or array type with a minimum length of '{1}'.
ru: Поле {0} должно быть строка или массив типа с минимальной длиной «{1}».
sv: Fältet {0} måste vara en sträng eller array-typ med en minsta längd av '{1}'.
vi: Các lĩnh vực {0} phải là một chuỗi hoặc mảng loại với chiều dài tối thiểu của '{1}'.

source: The field {0} must be a string with a maximum length of {1}.
ru: Поле {0} должна быть строка с максимальной длиной {1}.
sv: Fältet {0} måste vara en sträng med en maximal längd av {1}.
vi: Các lĩnh vực {0} phải là một chuỗi với chiều dài tối đa là {1}.

source: The field {0} must be a string with a minimum length of {2} and a maximum length of {1}.
ru: Поле {0} должно быть строка с минимальной длиной {2} и максимальной длиной {1}.
sv: Fältet {0} måste vara en sträng med en minsta längd av {2} och en maximal längd av {1}.
vi: Các lĩnh vực {0} phải là một chuỗi với chiều dài tối thiểu là {2} và chiều dài tối đa là {1}.

source: The field {0} must be between {1} and {2}.
ru: Поле {0} должно быть между {1} ​​и {2}.
sv: Fältet {0} måste vara mellan {1} och {2}.
vi: Các lĩnh vực {0} phải được giữa {1} và {2}.

source: The field {0} must match the regular expression '{1}'.
ru: Поле {0} должно соответствовать регулярному выражению «{1}».
sv: Fältet {0} måste matcha det reguljära uttrycket '{1}'.
vi: Các lĩnh vực {0} phải phù hợp với biểu thức chính quy '{1}'.

source: The instance provided must match the ObjectInstance on the ValidationContext supplied.
ru: Экземпляр при условии, должен соответствовать ObjectInstance на ValidationContext поставки.
sv: Förekomsten som måste matcha ObjectInstance på ValidationContext levereras.
vi: Các ví dụ được cung cấp phải phù hợp với ObjectInstance trên ValidationContext cung cấp.

source: The key parameter at position {0} is null. Every key control parameter must be a string.
ru: Ключевой параметр в позиции {0} равен нуль. Каждый ключевой параметр управления должен быть строкой.
sv: Nyckelparametern vid position {0} är null. Varje nyckelkontroll parameter måste vara en sträng.
vi: Các thông số quan trọng ở vị trí {0} là null. Mỗi tham số phím điều khiển phải là một chuỗi.

source: The key parameter at position {0} with value '{1}' is not a string. Every key control parameter must be a string.
ru: Ключевой параметр в позиции {0} со значением «{1}» не является строкой. Каждый ключевой параметр управления должен быть строкой.
sv: Nyckelparametern vid position {0} med värdet '{1}' är inte en sträng. Varje nyckelkontroll parameter måste vara en sträng.
vi: Các thông số quan trọng tại {0} vị trí có giá trị '{1}' không phải là một chuỗi. Mỗi tham số phím điều khiển phải là một chuỗi.

source: The key parameter at position {0} with value '{1}' occurs more than once.
ru: Ключевой параметр в позиции {0} со значением «{1}» встречается более чем один раз.
sv: Nyckelparametern vid position {0} med värdet '{1}' förekommer mer än en gång.
vi: Các thông số quan trọng tại {0} vị trí có giá trị '{1}' xảy ra nhiều hơn một lần.

source: The maximum length must be a nonnegative integer.
ru: Максимальная длина должна быть неотрицательным целым числом.
sv: Den maximala längden måste vara ett positivt heltal.
vi: Độ dài tối đa phải là một số nguyên không âm.

source: The maximum value '{0}' must be greater than or equal to the minimum value '{1}'.
ru: Максимальное значение «{0}» должно быть больше или равно минимальному значению «{1}».
sv: Det maximala värdet '{0}' måste vara större än eller lika med det minsta värdet '{1}'.
vi: Giá trị lớn nhất '{0}' phải lớn hơn hoặc bằng giá trị nhỏ nhất '{1}'.

source: The minimum and maximum values must be set.
ru: Минимальные и максимальные значения должны быть установлены.
sv: De lägsta och högsta värden måste ställas in.
vi: Tối thiểu và tối đa các giá trị phải được thiết lập.

source: The number of control parameters must be even.
ru: Количество управляющих параметров должно быть четным.
sv: Antalet styrparametrar måste vara ännu.
vi: Số lượng các thông số kiểm soát phải là chẵn.

source: The OperandType must be set when strings are used for minimum and maximum values.
ru: OperandType должен быть установлен, когда строки используются для минимальных и максимальных значений.
sv: Den OperandType måste ställas in när strängar används för min- och maxvärden.
vi: Các OperandType phải được thiết lập khi chuỗi được sử dụng cho các giá trị tối thiểu và tối đa.

source: The pattern must be set to a valid regular expression.
ru: Шаблон должен быть установлен действительный регулярное выражение.
sv: Mönstret måste ställas in på ett giltigt reguljärt uttryck.
vi: Các mô hình phải được đặt một biểu thức chính quy hợp lệ.

source: The property '{0}' on resource type '{1}' is not a string type.
ru: Свойство «{0}» на тип ресурса «{1}» не строковый тип.
sv: Egenskapen '{0}' på resurstypen '{1}' är inte en sträng typ.
vi: Thuộc tính '{0}' vào loại tài nguyên '{1}' không phải là một kiểu chuỗi.

source: The property {0}.{1} could not be found.
ru: Свойство {0}. {1} не может быть найден.
sv: Egenskapen {0}. {1} kunde inte hittas.
vi: Thuộc tính {0}. {1} không thể tìm được.

source: The resource type '{0}' does not have an accessible static property named '{1}'.
ru: Тип ресурса «{0}» не имеет доступного статическое свойство с именем «{1}».
sv: Den resurstypen '{0}' inte har en tillgänglig statisk egenskap med namnet '{1}'.
vi: Các loại tài nguyên '{0}' không có một tài sản tĩnh tiếp cận có tên là '{1}'.

source: The supplied value is invalid for {0}.
ru: Производимое значение является недопустимым для {0}.
sv: Den medföljande värdet är ogiltigt för {0}.
vi: Giá trị cung cấp không hợp lệ cho {0}.

source: The supplied value is invalid.
ru: Производимое значение является недействительным.
sv: Den medföljande värdet är ogiltigt.
vi: Giá trị cung cấp không hợp lệ.

source: The type '{0}' does not contain a public property named '{1}'.
ru: Типа «{0}» не содержит открытое свойство с именем «{1}».
sv: Den typ '{0}' inte innehåller en allmän egendom som heter '{1}'.
vi: Các loại '{0}' không chứa một tài sản công cộng có tên là '{1}'.

source: The type '{0}' needs to represent an enumeration type.
ru: Типа «{0}» должен представлять тип перечисления.
sv: Typ '{0}' måste representera en uppräkningstyp.
vi: Các loại '{0}' cần phải đại diện cho một kiểu liệt kê.

source: The type provided for EnumDataTypeAttribute cannot be null.
ru: Тип предусмотрено EnumDataTypeAttribute не может быть пустым.
sv: Den typ som avses EnumDataTypeAttribute kan inte vara null.
vi: Các loại quy EnumDataTypeAttribute không thể được null.

source: The type {0} must implement {1}.
ru: Тип {0} должен реализовывать {1}.
sv: Typen {0} måste implementera {1}.
vi: Loại {0} phải thực hiện {1}.

source: The value '{0}' is invalid.
ru: Значение «{0}» является недействительным.
sv: Värdet '{0}' är ogiltig.
vi: Giá trị '{0}' không hợp lệ.

source: The value '{0}' is not valid for {1}.
ru: Значение '{0}' не является допустимым для {1}.
sv: Värdet '{0}' är inte giltig för {1}.
vi: Giá trị '{0}' không hợp lệ cho {1}.

source: The value '{0}' is not valid.
ru: Значение «{0}» не является допустимым.
sv: Värdet '{0}' är inte giltig.
vi: Giá trị '{0}' là không hợp lệ.

source: The value for property '{0}' must be of type '{1}'.
ru: Значение свойства «{0}» должен быть типа «{1}».
sv: Värdet för egenskapen '{0}' måste vara av typen '{1}'.
vi: Giá trị tài sản '{0}' phải loại '{1}'.

source: The {0} field is not a valid credit card number.
ru: {0} поле не является допустимым номер кредитной карты.
sv: Den {0} fält är inte ett giltigt kreditkortsnummer.
vi: {0} lĩnh vực không phải là số thẻ tín dụng hợp lệ.

source: The {0} field is not a valid e-mail address.
ru: {0} поле не является действительным адресом электронной почты.
sv: Den {0} fältet är inte en giltig e-postadress.
vi: {0} lĩnh vực không phải là một địa chỉ e-mail hợp lệ.

source: The {0} field is not a valid fully-qualified http, https, or ftp URL.
ru: {0} поле не является действительным полностью квалифицированное HTTP, HTTPS, FTP или URL.
sv: På {0} fältet är inte en giltig fullt kvalificerade http, https, eller ftp URL.
vi: {0} lĩnh vực không phải là một giá trị đầy đủ trình độ http, https, ftp hoặc URL.

source: The {0} field is not a valid phone number.
ru: {0} поле не является допустимым номером телефона.
sv: Den {0} fält är inte ett giltigt telefonnummer.
vi: {0} lĩnh vực không phải là số điện thoại hợp lệ.

source: The {0} field is required.
ru: требуется {0} поле.
sv: På {0} fältet är obligatoriskt.
vi: {0} lĩnh vực là bắt buộc.

source: The {0} field only accepts files with the following extensions: {1}
ru: {0} поле принимает только файлы со следующими расширениями: {1}
sv: Den {0} fält accepterar endast filer med följande tillägg: {1}
vi: {0} trường chỉ chấp nhận những file với phần mở rộng sau: {1}

source: The {0} property has not been set. Use the {1} method to get the value.
ru: {0} свойство не было установлено. С помощью метода {1}, чтобы получить значение.
sv: Den {0} egenskapen har inte ställts in. Använd {1} metod för att få värdet.
vi: {0} tài sản chưa được thiết lập. Sử dụng {1} phương pháp để có được giá trị.

source: User already has a password set.
ru: Пользователь уже имеет набор пароля.
sv: Användaren har redan ett lösenord set.
vi: Người dùng đã có một bộ mật khẩu.

source: User already in role '{0}'.
ru: Пользователь уже в роли «{0}».
sv: Användaren redan roll '{0}'.
vi: Người dùng đã trong vai trò '{0}'.

source: User is not in role '{0}'.
ru: Пользователь не в роли «{0}».
sv: Användaren är inte i rollen '{0}'.
vi: Dùng không phải là trong vai trò '{0}'.

source: User name '{0}' is already taken.
ru: Имя пользователя «{0}» уже принято.
sv: Användarnamn '{0}' är upptaget.
vi: tên người dùng '{0}' đã được sử dụng.

source: User name '{0}' is invalid, can only contain letters or digits.
ru: Имя пользователя «{0}» является недействительным, может содержать только букву или цифру.
sv: Användarnamn '{0}' är ogiltig, kan bara innehålla bokstäver eller siffror.
vi: tên người dùng '{0}' không hợp lệ, chỉ có thể chứa các chữ cái hoặc chữ số.

source: {0} is not valid.
ru: {0} не является действительным.
sv: {0} är inte giltig.
vi: {0} là không hợp lệ.
