Repository: fanshuyi/.netcore-admin
Catalog: Web/LocalizationResources/ExpressLocalizationResource.*.resx
Languages: ru, sv, vi

source: '{0}' and '{1}' do not match.
ru: '{0}' и '{1}' не совпадают.
sv: '{0}' och '{1}' inte stämmer överens.
vi: '{0}' và '{1}' không khớp.
